scripts/load-testing/readQueries.yaml
config:
  target: 'https://biz-ops-staging.api.ft.com'
  plugins:
      statsd:
          host: localhost
          port: 8125
          prefix: load.
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: 'Ramp up'
    - duration: 1200
      arrivalRate: 10
      name: 'Cruise'
  processor: "./setup"
scenarios:
  - name: "GraphQL query that returns a list of all the systems and their corresponding properties."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Systems { code name description primaryURL systemType serviceTier serviceType hostPlatform containsPersonalData containsSensitiveData lifecycleStage SF_ID } }"
  - name: "GraphQL query that returns the url of all the healthchecks that are live."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{Healthchecks (isLive: true) { url }}"
  - name: "GraphQL query that returns a list of all the teams that are active and their corresponding properties."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Teams (isActive:true) { code name email slack phone isActive supportRota contactPref }}"
  - name: "GraphQL query that finds the team 'Service Desk' by name and returns all of its properties."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Team (name: \"Service Desk\") { email slack phone isActive supportRota contactPref }}"
  - name: "GraphQL query that returns a list of all products that have a Bronze serviceTier level."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Products (serviceTier: Bronze) { code purpose name serviceTier primaryURL lifecycleStage } }"
  - name: "GraphQL query that returns a list of repositories that are set to private."
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Repositories (isPrivate: true) { code name url vcsID sshUrl isPrivate isArchived description createdAt pushedAt shortDescriptionHTML projectName projectUrl } }"
  - name: "GraphQL query that returns a list of platinum system's system codes with support contacts"
    flow:
    - post:
        url: "/graphql"
        beforeRequest: "setHeaders"
        json:
            query: "{ Systems(first:600, serviceTier:Bronze) {code name description primaryURL systemType serviceTier serviceType hostPlatform containsPersonalData containsSensitiveData lifecycleStage SF_ID}}"